app/Controllers/Auth.php

SELECT *
FROM `posting`
ORDER BY `id` DESC
---
    public function viewposting()
    {
        $poster = new Postings();
        $data['posting'] = $poster->orderBy('id', 'DESC')->findAll();